# WorkingUnits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DGNExportOptions..::..WorkingUnits Property
DGNExportOptions Class See Also
---
If true, Main Units will be used. If false, Sub Units will be used. Default value of WorkingUnits is true.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public bool WorkingUnits { get; set; }
```

Visual Basic
---
```text
Public Property WorkingUnits As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool WorkingUnits {
	bool get ();
	void set (bool value);
}
```

# See Also
DGNExportOptions Class
Autodesk.Revit.DB Namespace